[Ability.A_change_element H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素汇流"
mTooltip="此生物每回合改变其元素伤害。攻击还会根据当前元素产生相应效果。"

[Ability.element_colors_Air_buff H7BaseBuff]
mName="自然气系"
mTooltip="此生物造成 %icon_air 气系伤害。"

[Ability.element_colors_earth_buff H7BaseBuff]
mName="自然土系"
mTooltip="此生物造成 %icon_earth 土系伤害。"

[Ability.element_colors_fire_buff H7BaseBuff]
mName="自然火系"
mTooltip="此生物造成 %icon_fire 火焰伤害。"

[Ability.element_colors_water_buff H7BaseBuff]
mName="自然水系"
mTooltip="此生物造成 %icon_water 水流伤害。"

[Ability.element_colors_Prime_buff H7BaseBuff]
mName="自然本源"
mTooltip="此生物造成 %icon_Prime 源力伤害。"

[Ability.element_colors_setting2_buff H7BaseBuff]
mName=""
mTooltip="设定元素"

[Ability.element_colors_setting3_buff H7BaseBuff]
mName=""
mTooltip="设定元素"

[Ability.element_colors_setting4_buff H7BaseBuff]
mName=""
mTooltip="设定元素"

[Ability.element_colors_setting5_buff H7BaseBuff]
mName=""
mTooltip="设定元素"

[Ability.element_colors_setting_buff H7BaseBuff]
mName=""
mTooltip="设定元素"

[Creature.A_Creature_t3_base_conf H7Creature]
mName="元素信徒"
mLore="在元素汇点的庇护下，元素塑形者赢得了稳固的地位。但要成为一名训练有素的元素塑形者，还有很长的路要走。训练从使用弓箭的信徒开始，重点不在于击中目标，而在于集中精神和冥想，使身心摆脱所有元素影响。掌握所有元素的道路始于最原始的元素——大地。"

[Creature.A_Creature_t3_conf H7Creature]
mName="元素塑形者"
mLore="经过多年的训练，最优秀的元素信徒设法完善了他们的箭术，并平等地掌握了所有元素。从这时起，他们被称为元素塑形者。\n \n远程技能描述：\n技能按顺序交替，土、火、水、气、源力 \n土 - 造成基础土系伤害，使目标移动力减少2点，持续2回合 \n火 - 造成基础火焰伤害，对敌方单位施加燃烧效果，持续2回合，每名元素塑形者造成伤害 \n水 - 造成基础水流伤害，治疗目标相邻的友方单位，每名元素塑形者治疗量 \n气 - 造成基础气系伤害，忽略敌方防御 \n源力 - 造成基础源力伤害，降低敌方幸运50点，持续两回合"

[Ranged_Air.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="气系射击"
mTooltip="对目标造成 %d %icon_air 气系伤害（此攻击忽略目标的防御）。"

[Ranged_earth.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="土系射击"
mTooltip="对目标造成 %d %icon_earth 土系伤害，并使其移动力减少 %buff.buff.stat %icon_movement，持续 %buff.buff.durini 回合。"

[Ranged_earth.A_Nova_ia H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素射击"
mTooltip="对目标造成 %d 元素伤害，并施加与当前元素相匹配的效果"

[Ranged_earth.Earth_debuff H7BaseBuff]
mName="阻碍"
mTooltip="该生物的移动力减少 %stat %icon_movement，持续 %durnow 回合。"

[Ranged_fire.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰射击"
mTooltip="对目标造成 %d %icon_fire 火焰伤害并使其燃烧，在 %buff.buff.durini 回合内造成 %buff.buff.d %icon_fire 伤害。"

[Ranged_fire.fire_debuff H7BaseBuff]
mName="燃烧"
mTooltip="此生物在其回合开始时受到 %d %icon_fire 火焰伤害，持续 %durnow 回合。"

[Ranged_Prime.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力射击"
mTooltip="对目标造成 %d %icon_prime 源力伤害，并使其 %icon_luck 幸运减少 %buff.buff.stat，持续 %buff.buff.durini 回合。"

[Ranged_Prime.Prime_debuff H7BaseBuff]
mName="偏执"
mTooltip="此生物的幸运减少 %stat %icon_luck，持续 %durnow 回合。"

[Ranged_Secrete.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="终极攻击（秘密）"
mTooltip="当此生物被复活时，它会激活一个秘密能力，允许你选择攻击元素，该攻击忽略目标的防御。"

[Ranged_water.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水流射击"
mTooltip="对目标造成 %d %icon_water 水流伤害，并治疗目标相邻的友方单位 %buff.buff.d %icon_health 生命值。"

[Ranged_water.Water_buff H7BaseBuff]
mName="关怀之波"
mTooltip="此生物恢复 %d %icon_health 生命值。"